export default {
  // user 异常
  10101: '用户名及密码及重复输入密码不能为空',
  10102: '注册失败:用户名只能有6-12位a-z0-9组成',
  10103: '注册失败:密码只能只能有6-20位a-z0-9组成',
  10104: '注册失败:密码不能包含+-符号',
  10114: '注册失败:请选择性别',
  10105: '重复输入密码不一致',
  10106: '用户名及密码不能为空',
  10107: '只允许修改昵称和头像',
  10108: '昵称只允许由2-12个字符组成',
  10109: '用户头像解析异常',
  10110: '标签名仅可为2-6个字符',
  // 标签异常
  10111: '请输入标签名',
  10112: '标签名重复，请重新输入',
  10113: '标签最多为8个，请修改标签名或删除后再添加',
  // user 异常
  10201: '注册失败:用户名已经存在',
  10202: '用户名或密码错误',
  // 数据库异常
  20101: '数据库异常',
  // token异常
  30101: '用户未登录',
  30102: 'token过期',
  30103: 'token无效',
  // 系统异常
  40101: '标签系统异常,请稍后再试',
  // 文章异常
  50101: '缺少必要字段,请检查后重试',
  50102: '文章标题必须为1-20个字',
  // 留言异常
  60101: '无配对用户，无法使用留言功能'
}
